<?php
/**
 * Created by PhpStorm.
 * User: agla
 * Date: 19/02/18
 * Time: 16:45
 */

require_once( "../im_tools.php" );

print header_text( false, true, false );

// if (! isset($_GET["operation"])) die(1);

//$operation = $_GET["operation"];
//
//print header_text(false, true, false);
//
//switch ($operation)
//{
//	case "clear_cart":
//		clear_cart();
//		break;
//
//	case "add":
//		$line = urldecode($_GET["line"]);
//		// print $line . "<br/>";
//		im_add_to_cart($line);
//
//}

$text = "19.02.2018 04:28:54:   |  נייר אפייה טבעי 24 יח If You Care 3
19.02.2018 04:28:54:   |  כרוב לבן 1
19.02.2018 04:28:54:   |  כרוב לבן בייבי 1
19.02.2018 04:28:54:   |  כרוב סגול בייבי 1
19.02.2018 04:28:54:   |  ירקות סוג ב' 1
19.02.2018 04:28:54:   |  תפוח אדמה 1
19.02.2018 04:28:54:   |  צנונית אדומה צרור 2
19.02.2018 04:28:54:   |  בצל ירוק 1
19.02.2018 04:28:54:   |  סלרי שורש 3
19.02.2018 04:28:54:   |  בצל יבש 3
19.02.2018 04:28:54:   |  תפוח אדמה אדום 1
19.02.2018 04:28:54:   |  פלפל חריף יחידה 1
19.02.2018 04:28:54:   |  עגבניה 1
19.02.2018 04:28:54:   |  מלפפון 3
19.02.2018 04:28:54:   |  פלפל סוויט בייט יחידה 2
19.02.2018 04:28:54:   |  דלורית 1
19.02.2018 04:28:54:   |  בטטה 3.5
19.02.2018 04:28:54:   |  גזר 2
19.02.2018 04:28:54:   |  צנונית צבעונית 1
19.02.2018 04:28:54:   |  פלפל כתום 5.5
19.02.2018 04:28:54:   |  אשכולית אדומה 2
19.02.2018 04:28:54:   |  תפוז 5
19.02.2018 04:28:54:   |  לימון 2
19.02.2018 04:28:54:   |  לימון ננסי - אריזה 3
19.02.2018 04:28:54:   |  צנון שחור אורגני קג 1
19.02.2018 04:28:54:   |  סלק אדום 0.5
19.02.2018 04:28:54:   |  דלעת יפנית 2
19.02.2018 04:28:54:   |  חציל 2
19.02.2018 04:28:54:   |  מלפפון בייבי 5
19.02.2018 04:28:54:   |  עגבניה שרי תמר אריזה 8
19.02.2018 04:28:54:   |  רימון 3
19.02.2018 04:28:54:   |  פומלית 1
19.02.2018 04:28:54:   |  פומלה אדומה 2
19.02.2018 04:28:54:   |  שום ירוק 2
19.02.2018 04:28:54:   |  קישוא צהוב 1
19.02.2018 04:28:54:   |  קישוא פסים 2
19.02.2018 04:28:54:   |  ברוקולי  1 ק\"ג 1
19.02.2018 04:28:54:   |  ארטישוק 1.5
19.02.2018 04:28:54:   |  אבוקדו האס 10
19.02.2018 04:28:54:   |  כורכום טרי 1
19.02.2018 04:28:54:   |  קולרבי 2
19.02.2018 04:28:54:   |  בננה אורגנית לא מובחלת 9
19.02.2018 04:28:54:   |  פפאיה 5
19.02.2018 04:28:54:   |  אפונה שלג 0.5
19.02.2018 04:28:54:   |  נענע 3
19.02.2018 04:28:54:   |  פטרוזיליה 2
19.02.2018 04:28:54:   |  חסה ערבית 2
19.02.2018 04:28:54:   |  קייל 1
19.02.2018 04:28:54:   |  כוסברה 5
19.02.2018 04:28:54:   |  עלי רוקט 2
19.02.2018 04:28:54:   |  בזיליקום 1
19.02.2018 04:28:54:   |  תרד תורכי   צרור 1
19.02.2018 04:28:54:   |  שומר 0.5
19.02.2018 04:28:54:   |  גרעיני דלעת קלופים תבואות 300 ג 2
19.02.2018 04:28:54:   |  זרעי ציה אורגנים 300 גר 1
19.02.2018 04:28:54:   |  גרעיני חמניה   300 גרם 2
19.02.2018 04:28:54:   |  פקאן אורגני קלוף - 100 ג 2
19.02.2018 04:28:54:   |  תמר ברהי  1 ק\"ג 3
19.02.2018 04:28:54:   |  קישוא כהה  זוקיני 1
19.02.2018 04:28:54:   |  גינגר אורגני  משקל 0.5
19.02.2018 04:28:54:   |  עלי בייבי מיקס 1
19.02.2018 04:28:54:   |  חמניות קלופות תבואות 300 ג 1";

clear_cart();
$lines = explode( "\n", $text );

foreach ( $lines as $line ) {
	print $line;
	im_add_to_cart( $line );
}

function im_add_to_cart( $line ) {
	$words = explode( " ", $line );

	$q = array_pop( $words );
	print "quantity: " . $q . "<br/>";

	array_shift( $words ); // date
	array_shift( $words ); // time
	array_shift( $words ); // |
	array_shift( $words ); // |
	array_shift( $words ); // |

	$product_name = trim( implode( " ", $words ) );

//	print "x". $product_name . "x<br/>";

	$prod_id = get_product_id_by_name( $product_name );

	print $prod_id . "<br/>";
	WC()->cart->add_to_cart( $prod_id, $q );
}

function clear_cart() {
	$cart = WC()->cart;

	$cart->empty_cart();
}

//function add_to_cart($prod_id, $quantity)
//{
//	$cart =  WC()->cart;
//
//}